export type Leader = {
  name: string;
  position: string;
  image: string;
  experience: string[];
  achievements: string[];
};

export const leaders: Leader[] = [
  {
    name: "นายศุภกร โสวณะปรีชา",
    position: "ผู้ลงสมัครประธานสภานักเรียน/หัวหน้าพรรค",
    image: "/images/leaders/leader-1.png",
    experience: [
      "วิทยากร First Step Young Innovator ปีการศึกษา 2569",
      "คณะกรรมการฝ่ายสันทนาการ Pig Smart Camp ณ โรงเรียนบ้านตุงลอย อ.อมก๋อย จังหวัดเชียงใหม่",
      "คณะกรรมการฝ่ายสันทนาการ ตราษฯ ตื่นรู้ สู้โลกร้อน",
      "ผู้ช่วยคณะกรรมการดำเนินงานมหกรรมวิชาการ 46ICTฯ",
      "แนะแนวประชาสัมพันธ์โรงเรียนในเขตพื้นที่บริการ ปีการศึกษา 2568",
    ],
    achievements: [
      "เหรียญทอง โครงงานคณิตศาสตร์ มหกรรมวิชาการฯ ภาคกลาง โซน C",
      "รองชนะเลิศอันดับ 1 Hero GenZ กสทช.",
      "เหรียญทองแดง สร้างเกมสร้างสรรค์จากคอมพิวเตอร์ งานศิลปหัตถกรรมนักเรียน ครั้งที่ 71 จังหวัดตราด",
      "เข้าร่วมการแข่งขัน NBGC 2025",
    ],
  },
  {
    name: "นายเปรมปรีดี บุญเนาว์",
    position: "รองฯ ฝ่ายบริหารวิชาการ/เลขาธิการพรรค",
    image: "/images/leaders/leader-2.png",
    experience: [
      "นักวิจัยโครงการพัฒนานวัตกรรมเพื่อชุมชนบนพื้นที่สูงร่วมกับมหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี",
      "ทำงานร่วมกับกลุ่มบริหารทั่วไป กลุ่มบริหารวิชาการ และกลุ่มบริหารงานบุคคล โรงเรียนตราษตระการคุณ",
      "คณะกรรมการฝ่ายประชาสัมพันธ์/พิธีการ/ที่ปรึกษาหุ่นยนต์ผสม งานมหกรรมวิชาการ 46ICTฯ",
      "คณะกรรมการฝ่ายพิธีการ T.K. OpenHouse ปีการศึกษา 2567-2568",
      "ประธานโครงการ First Step Young Innovator ปีการศึกษา 2567-2569",
      "ประธานโครงการ Bye Nior SMTE Dream On, Fly On.",
      "แนะแนวประชาสัมพันธ์โรงเรียนในเขตพื้นที่บริการ ปีการศึกษา 2565-2568",
    ],
    achievements: [
      "รองชนะเลิศอันดับ 1 โครงงานสะเต็มศึกษาและกล่องสมองกล 46ICT จังหวัดภูเก็ต",
      "เหรียญทอง 4 ทีมสุดท้าย การแข่งขันหุ่นยนต์ผสม งานศิลปหัตถกรรมนักเรียนระดับชาติ ครั้งที่ 70 จังหวัดราชบุรี",
      "เหรียญทอง Thailand New Gen Inventor Award 2026",
      "โล่รางวัลชนะเลิศ BEST OF THE BEST ผลงาน STEM Education S-S-S-S 2025",
      "Best Programing โครงการ Junior Webmaster Camp 14 จัดโดย สมาคมผู้ดูแลเว็บไซต์และสื่อออนไลน์ไทย",
      "ผ่านการอบรมโครงการ IT Camp 21-22 จัดโดย คณะเทคโนโลยีสารสนเทศ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง",
    ],
  },
  {
    name: "นางสาวอรชัญญา เลียดประถม",
    position: "รองฯ ฝ่ายบริหารกิจการนักเรียน",
    image: "/images/leaders/leader-3.png",
    experience: [
      "ผู้ช่วยคณะกรรมการดำเนินงานมหกรรมวิชาการ 46ICTฯ",
      "นักเรียนจิตอาสา การออกแบบสร้างสรรค์ผลิตภัณฑ์เพื่อส่งเสริมและสนับสนุนการดูแลสุขภาพในชุมชน โรงพยาบาลส่งเสริมสุขภาพตำบลบ้านแฮด",
    ],
    achievements: [
      "เหรียญทองลำดับที่ 5 Multi-Skill Competition มหกรรมวิชาการฯ ภาคกลาง โซน C",
      "ชนะเลิศ การแข่งขันรำและระบำมาตรฐาน งานศิลปหัตถกรรมนักเรียนครั้งที่ 72",
      "ผ่านเข้ารอบชิงชนะเลิศ เบญจมรัชฉัฐราชาคุณานุสรณ์ ครั้งที่ 6",
      "ผ่านการอบรมกิจกรรมมารยาทงามตามวัฒนธรรมไทย โครงการส่งเสริมผู้เรียนให้มีคุณธรรม",
      "ผ่านการอบรมโครงการพัฒนานักเรียนสู่ความเป็นเลิศวิชาคณิตศาสตร์ ปีการศึกษา 2568",
      "ผ่านการอบรมค่ายภูมิศาสตร์โอลิมปิก ปีการศึกษา 2569",
    ],
  },
  {
    name: "นายพิริยะ อินทสุวรรณ์",
    position: "รองฯ ฝ่ายบริหารกิจกรรม",
    image: "/images/leaders/leader-4.png",
    experience: [
      "เลขานุการและกรรมการนักเรียนฝ่ายประชาสัมพันธ์ โรงเรียนอ่าวใหญ่พิทยาคาร",
      "Staff กิจกรรมปฐมนิเทศ ม.1 & ม.4 ปีการศึกษา 2569",
    ],
    achievements: [
      "คณะกรรมการสภานักเรียนดีเด่น ปีการศึกษา 2567 (โรงเรียนอ่าวใหญ่พิทยาคาร)",
      "รางวัลชมเชย 16 ทีมสุดท้าย Coding Boostcamp by Depa ภาคตะวันออก",
      "ชนะเลิศ การแข่งขันภาพยนต์สั้น งานศิลปหัตถกรรมนักเรียนครั้งที่ 72 จังหวัดตราด",
    ],
  },
  {
    name: "นายกชภูมิ มังคลาดุง",
    position: "รองฯ ฝ่ายบริหารทั่วไป",
    image: "/images/leaders/leader-5.png",
    experience: [
    ],
    achievements: [
      "ชนะเลิศ กาแข่งขันฟุตบอลชาย 7 คน กีฬาสานสัมพันธ์มัธยมศึกษาตราด ครั้งที่ 2",
      "รองชนะเลิศอันดับ 1 การแข่งขันฟุตซอลเยาวชนจังหวัดตราด U17 ประจำปี 2567-2568",
      "ผ่านคัดเลือกรอบ 256 ทีม ฟุตบอลนักเรียน 7 คน แชมป์กีฬา 7HD 2025",
      "นักกีฬาโรงเรียนเข้าร่วมการแข่งขันฟุตบอล 11 คน U16 Thailand Prime Minister Cup 2024",
      "นักกีฬาโรงเรียนเข้าร่วมการแข่งขันฟุตซอลเยาวชนจังหวัดตราด U17 ประจำปี 2567-2568",
    ],
  },
];
